In [1]:
import pandas as pd
import numpy as np

In [2]:
df_train = pd.read_csv('./data/train_1k.csv')
df_test = pd.read_csv('./data/test.csv')

In [3]:
df_test.head()

,key,pickup_datetime,pickup_longitude,pickup_latitude,dropoff_longitude,dropoff_latitude,passenger_count
0,2015-01-27 13:08:24.0000002,2015-01-27 13:08:24 UTC,-73.973320,40.763805,-73.981430,40.743835,1
1,2015-01-27 13:08:24.0000003,2015-01-27 13:08:24 UTC,-73.986862,40.719383,-73.998886,40.739201,1
2,2011-10-08 11:53:44.0000002,2011-10-08 11:53:44 UTC,-73.982524,40.751260,-73.979654,40.746139,1
3,2012-12-01 21:12:12.0000002,2012-12-01 21:12:12 UTC,-73.981160,40.767807,-73.990448,40.751635,1
4,2012-12-01 21:12:12.0000003,2012-12-01 21:12:12 UTC,-73.966046,40.789775,-73.988565,40.744427,1

In [4]:
a = df_test[df_test['key'] == '2014-06-14 13:39:00.000000170']
a

,key,pickup_datetime,pickup_longitude,pickup_latitude,dropoff_longitude,dropoff_latitude,passenger_count
75,2014-06-14 13:39:00.000000170,2014-06-14 13:39:00 UTC,-73.948185,40.774497,-73.98173,40.767695,1

In [5]:
df_submit = pd.read_csv('./datasubmission_knn_1660488276.0.csv')
df_submit.head()

                             key  fare_amount
0  2015-01-27 13:08:24.000000200       11.090
1  2015-01-27 13:08:24.000000300        7.380
2  2011-10-08 11:53:44.000000200        7.434
3  2012-12-01 21:12:12.000000200       10.230
4  2012-12-01 21:12:12.000000300       11.040

In [6]:
b = df_submit[df_submit['key'] == '2014-06-14 13:39:00.000000170']
b

                              key  fare_amount
37  2014-06-14 13:39:00.000000170         7.15
65  2014-06-14 13:39:00.000000170        11.10

In [9]:
df_test.iloc[37]

key                  2014-06-14 13:39:00.00000059
pickup_datetime           2014-06-14 13:39:00 UTC
pickup_longitude                       -74.005682
pickup_latitude                         40.738755
dropoff_longitude                       -73.99507
dropoff_latitude                         40.73487
passenger_count                                 1
Name: 37, dtype: object

In [10]:
df_test.iloc[65]

key                  2014-06-14 13:39:00.000000181
pickup_datetime            2014-06-14 13:39:00 UTC
pickup_longitude                        -73.975752
pickup_latitude                          40.781657
dropoff_longitude                       -73.982252
dropoff_latitude                          40.77054
passenger_count                                  1
Name: 65, dtype: object

In [13]:
df_submit2 = pd.read_csv('./datasubmission_knn_1660490197.0.csv')
df_submit2.head()

                           key  fare_amount
0  2015-01-27 13:08:24.0000002        10.48
1  2015-01-27 13:08:24.0000003         8.07
2  2011-10-08 11:53:44.0000002         6.14
3  2012-12-01 21:12:12.0000002         9.94
4  2012-12-01 21:12:12.0000003        10.85

In [15]:
c = df_submit2[df_submit2['key'] == '2014-06-14 13:39:00.000000170']
c

                              key  fare_amount
65  2014-06-14 13:39:00.000000170        12.07